yannickmayannick/circuitpython/ports/espressif/boards/lilygo_tembed_esp32s3/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "LILYGO TEMBED ESP32S3"
#define MICROPY_HW_MCU_NAME         "ESP32S3"

#define MICROPY_HW_APA102_MOSI   (&pin_GPIO42)
#define MICROPY_HW_APA102_SCK    (&pin_GPIO45)
#define MICROPY_HW_APA102_COUNT (7)

#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO11)
#define DEFAULT_SPI_BUS_SCK (&pin_GPIO12)

#define DEFAULT_UART_BUS_RX         (&pin_GPIO44)
#define DEFAULT_UART_BUS_TX         (&pin_GPIO43)
